Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "wrestleutopia_workflow_schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(5 minutes)"
      + tags_all            = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_event_target.state_machine_target will be created
+ resource "aws_cloudwatch_event_target" "state_machine_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + role_arn       = (known after apply)
      + rule           = "wrestleutopia_workflow_schedule"
      + target_id      = "wrestleutopia_StepFunctionStateMachine"
    }

  # aws_cloudwatch_log_group.automated_step_function_log_group will be created
+ resource "aws_cloudwatch_log_group" "automated_step_function_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/automated_wrestleutopia_workflow"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_log_group.fetch_data_log_group will be created
+ resource "aws_cloudwatch_log_group" "fetch_data_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/fetch_data"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_log_group.manual_step_function_log_group will be created
+ resource "aws_cloudwatch_log_group" "manual_step_function_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/manual_wrestleutopia_workflow"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_log_group.notify_post_log_group will be created
+ resource "aws_cloudwatch_log_group" "notify_post_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/notify_post"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_log_group.process_content_log_group will be created
+ resource "aws_cloudwatch_log_group" "process_content_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/process_content"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_log_group.render_video_log_group will be created
+ resource "aws_cloudwatch_log_group" "render_video_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/render_video"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_log_group.sns_to_teams_log_group will be created
+ resource "aws_cloudwatch_log_group" "sns_to_teams_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sns_to_teams"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_log_group.step_function_log_group will be created
+ resource "aws_cloudwatch_log_group" "step_function_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/automated_wrestleutopia_workflow"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_log_group.store_data_log_group will be created
+ resource "aws_cloudwatch_log_group" "store_data_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/store_data"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_log_group.vpc_flow_logs will be created
+ resource "aws_cloudwatch_log_group" "vpc_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_metric_alarm.dlq_alarm will be created
+ resource "aws_cloudwatch_metric_alarm" "dlq_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Triggers if there are any messages in the DLQ."
      + alarm_name                            = "wrestleutopia-dlq-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "wrestleutopia-lambda-dlq"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.fetch_data_errors will be created
+ resource "aws_cloudwatch_metric_alarm" "fetch_data_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if Lambda functions return any errors in a 5-minute window."
      + alarm_name                            = "wrestleutopia-fetch-data-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "notify_post"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.lambda_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "lambda_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if Lambda invocations deviates from normal"
      + alarm_name                            = "LambdaInvocationsAnomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "InvocationsWithAnomalyDetection"
          + return_data = false
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "notify_post"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.step_functions_failures will be created
+ resource "aws_cloudwatch_metric_alarm" "step_functions_failures" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if any Step Function executions fail within a 5-minute window."
      + alarm_name                            = "wrestleutopia-stepfunctions-failures"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsFailed"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_efs_access_point.lambda_ap will be created
+ resource "aws_efs_access_point" "lambda_ap" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags_all        = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/lambda"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "755"
            }
        }
    }

  # aws_efs_file_system.lambda_efs will be created
+ resource "aws_efs_file_system" "lambda_efs" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = "lambda-efs"
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = "generalPurpose"
      + size_in_bytes           = (known after apply)
      + tags_all                = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + throughput_mode         = "bursting"

      + protection (known after apply)
    }

  # aws_efs_mount_target.efs_mount["0"] will be created
+ resource "aws_efs_mount_target" "efs_mount" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # aws_efs_mount_target.efs_mount["1"] will be created
+ resource "aws_efs_mount_target" "efs_mount" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # aws_flow_log.vpc_flow_logs will be created
+ resource "aws_flow_log" "vpc_flow_logs" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_policy.eventbridge_policy will be created
+ resource "aws_iam_policy" "eventbridge_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for CloudWatch Event to start Step Functions executions"
      + id               = (known after apply)
      + name             = "wrestleutopia_eventbridge_step_functions_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_iam_policy.s3_full_policy will be created
+ resource "aws_iam_policy" "s3_full_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow Lambda full access to S3"
      + id               = (known after apply)
      + name             = "wrestleutopia_s3_full_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::prod-wrestleutopia-media-bucket",
                          + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_iam_role.eventbridge_role will be created
+ resource "aws_iam_role" "eventbridge_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "wrestleutopia_eventbridge_step_functions_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.lambda_role will be created
+ resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "wrestleutopia_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.step_functions_role will be created
+ resource "aws_iam_role" "step_functions_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "wrestleutopia_step_functions_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.vpc_flow_logs_role will be created
+ resource "aws_iam_role" "vpc_flow_logs_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vpc-flow-logs-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.step_functions_policy will be created
+ resource "aws_iam_role_policy" "step_functions_policy" {
      + id          = (known after apply)
      + name        = "wrestleutopia_step_functions_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.vpc_flow_logs_role_policy will be created
+ resource "aws_iam_role_policy" "vpc_flow_logs_role_policy" {
      + id          = (known after apply)
      + name        = "vpc-flow-logs-role-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_eventbridge_policy will be created
+ resource "aws_iam_role_policy_attachment" "attach_eventbridge_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "wrestleutopia_eventbridge_step_functions_role"
    }

  # aws_iam_role_policy_attachment.lambda_basic_execution will be created
+ resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "wrestleutopia_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_insights_policy will be created
+ resource "aws_iam_role_policy_attachment" "lambda_insights_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "wrestleutopia_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_s3_full_access will be created
+ resource "aws_iam_role_policy_attachment" "lambda_s3_full_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "wrestleutopia_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_vpc_access will be created
+ resource "aws_iam_role_policy_attachment" "lambda_vpc_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "wrestleutopia_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_xray_write_access will be created
+ resource "aws_iam_role_policy_attachment" "lambda_xray_write_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSXRayDaemonWriteAccess"
      + role       = "wrestleutopia_lambda_role"
    }

  # aws_internet_gateway.igw will be created
+ resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + vpc_id   = (known after apply)
    }

  # aws_lambda_function.check_duplicate will be created
+ resource "aws_lambda_function" "check_duplicate" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/check_duplicate/check_duplicate.zip"
      + function_name                  = "check_duplicate"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "PgALpBX53DPvC2CMYLZAFggEIw39no63f9XJEs769fA="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "IDEMPOTENCY_BUCKET" = "prod-wrestleutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.fetch_data will be created
+ resource "aws_lambda_function" "fetch_data" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/fetch_data/fetch_data.zip"
      + function_name                  = "fetch_data"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "I9Gs0kEtJ15YVxufx53FN/eCjX9MRFOFTe6YxQ3qrao="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.notify_post will be created
+ resource "aws_lambda_function" "notify_post" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/notify_post/notify_post.zip"
      + function_name                  = "notify_post"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:825765422855:layer:Python_Requests:1",
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "WcnSdEzALE3Cuvl7OhAVNer9j4hpLwrHQp0bnnqqoEk="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "TARGET_BUCKET"     = "prod-wrestleutopia-media-bucket"
              + "TEAMS_WEBHOOK_URL" = "https://feedutopia.webhook.office.com/webhookb2/4d9dfc6f-4e46-45e9-842b-b9bb0343b83d@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/a40586b415b64e8fb9c188fc82a23559/2742a55c-9d93-47f0-aed1-1965283926c0/V2UwbSe1Rj0AKXMVwKk7dmo11nGQUrDxaAiN-DkdQVo5U1"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.process_content will be created
+ resource "aws_lambda_function" "process_content" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/process_content/process_content.zip"
      + function_name                  = "process_content"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:825765422855:layer:imagick-layer:2",
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Td26HcoiXa6cHsrEM2nVuq7CLaha7OM86F61zkgUAdM="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "IMAGE_MAGICK_EXE" = "/bin/magick"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = (known after apply)
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_function.render_video will be created
+ resource "aws_lambda_function" "render_video" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "render_video"
      + id                             = (known after apply)
      + image_uri                      = "390402544450.dkr.ecr.us-east-2.amazonaws.com/render_video_repository:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 3008
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "FFMPEG_PATH"   = "/opt/bin/ffmpeg"
              + "TARGET_BUCKET" = "prod-wrestleutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + file_system_config {
          + arn              = (known after apply)
          + local_mount_path = "/mnt/efs"
        }

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = (known after apply)
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_function.sns_to_teams will be created
+ resource "aws_lambda_function" "sns_to_teams" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/sns_to_teams/sns_to_teams.zip"
      + function_name                  = "wrestleutopia-sns-to-teams"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "SmQeRJIPd007wVv/+NQjFyFye58FW3WeqzrCJ7OUBug="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "TEAMS_WEBHOOK_URL" = "https://feedutopia.webhook.office.com/webhookb2/15bab4d6-66e1-4121-8e53-f72e565043db@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/74d88730408141d995e6d3332f350d9c/2742a55c-9d93-47f0-aed1-1965283926c0/V2HdJ-E9GgUG_Vndpd0UX6B240fszGkuj9F-du8xCTvvA1"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.store_data will be created
+ resource "aws_lambda_function" "store_data" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/store_data/store_data.zip"
      + function_name                  = "store_data"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "qfUnhhv04BvKInKPTbCBOHSAWgom7HXJiU8bKfp0URM="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "BUCKET_NAME" = "prod-wrestleutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_permission.allow_sns_invoke will be created
+ resource "aws_lambda_permission" "allow_sns_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "wrestleutopia-sns-to-teams"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # aws_route_table.public_rt will be created
+ resource "aws_route_table" "public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public_rta["0"] will be created
+ resource "aws_route_table_association" "public_rta" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_rta["1"] will be created
+ resource "aws_route_table_association" "public_rta" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.media_bucket will be created
+ resource "aws_s3_bucket" "media_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prod-wrestleutopia-media-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.media_bucket_lifecycle will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "media_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "delete_posts_after_1_week"
          + prefix = (known after apply)
          + status = "Enabled"

          + expiration {
              + days                         = 7
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + object_size_greater_than = (known after apply)
              + object_size_less_than    = (known after apply)
              + prefix                   = "posts/"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.media_bucket_encryption will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "media_bucket_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "alias/aws/s3"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.media_bucket_versioning will be created
+ resource "aws_s3_bucket_versioning" "media_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_security_group.efs_sg will be created
+ resource "aws_security_group" "efs_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for EFS mount for Lambda"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.0.0/16",
                ]
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2049
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "efs_lambda_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.lambda_sg will be created
+ resource "aws_security_group" "lambda_sg" {
      + arn                    = (known after apply)
      + description            = "Allow Lambda to call out to the internet"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "wrestleutopia-lambda-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_sfn_state_machine.automated_workflow will be created
+ resource "aws_sfn_state_machine" "automated_workflow" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "automated_wrestleutopia_workflow"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + type                      = "EXPRESS"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ALL"
          + log_destination        = (known after apply)
        }

      + tracing_configuration (known after apply)
    }

  # aws_sfn_state_machine.manual_workflow will be created
+ resource "aws_sfn_state_machine" "manual_workflow" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "manual_wrestleutopia_workflow"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + type                      = "EXPRESS"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ALL"
          + log_destination        = (known after apply)
        }

      + tracing_configuration (known after apply)
    }

  # aws_sns_topic.monitoring_topic will be created
+ resource "aws_sns_topic" "monitoring_topic" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "wrestleutopia-monitoring-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.sns_lambda_subscription will be created
+ resource "aws_sns_topic_subscription" "sns_lambda_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sqs_queue.lambda_dlq will be created
+ resource "aws_sqs_queue" "lambda_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "wrestleutopia-lambda-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue_policy.lambda_dlq_policy will be created
+ resource "aws_sqs_queue_policy" "lambda_dlq_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # aws_subnet.public_subnet[0] will be created
+ resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet[1] will be created
+ resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
+ resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_xray_group.production_group will be created
+ resource "aws_xray_group" "production_group" {
      + arn               = (known after apply)
      + filter_expression = "annotation.stage = 'prod'"
      + group_name        = "ProductionTraces"
      + id                = (known after apply)
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }

      + insights_configuration (known after apply)
    }

  # aws_xray_sampling_rule.critical_service_rule will be created
+ resource "aws_xray_sampling_rule" "critical_service_rule" {
      + arn            = (known after apply)
      + fixed_rate     = 1
      + host           = "*"
      + http_method    = "*"
      + id             = (known after apply)
      + priority       = 10
      + reservoir_size = 2
      + resource_arn   = "*"
      + rule_name      = "CriticalService"
      + service_name   = "my-critical-service"
      + service_type   = "*"
      + tags_all       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + url_path       = "*"
      + version        = 1
    }

  # aws_xray_sampling_rule.fallback_rule will be created
+ resource "aws_xray_sampling_rule" "fallback_rule" {
      + arn            = (known after apply)
      + fixed_rate     = 0.05
      + host           = "*"
      + http_method    = "*"
      + id             = (known after apply)
      + priority       = 9999
      + reservoir_size = 1
      + resource_arn   = "*"
      + rule_name      = "Fallback"
      + service_name   = "*"
      + service_type   = "*"
      + tags_all       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + url_path       = "*"
      + version        = 1
    }

  # null_resource.attach_sfn_policy will be created
+ resource "null_resource" "attach_sfn_policy" {
      + id = (known after apply)
    }

Plan: 68 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 68 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```